////斐波那契数 （通常用 F(n) 表示）形成的序列称为 斐波那契数列 
////该数列由 0 和 1 开始，后面的每一项数字都是前面两项数字的和。也就是：
////F(0) = 0，F(1) = 1
////F(n) = F(n - 1) + F(n - 2)，其中 n > 1
////给定 n ，请计算 F(n) 。
////
////答案需要取模 1e9 + 7(1000000007) ，如计算初始结果为：1000000008，请返回 1。
//
//#include <stdio.h>
//
//int fib(int n)
//{
//	if (n < 2) return n;
//	int prev_1 = 0;
//	int prev_2 = 1;
//	int curr = 0;
//	for (int i = 2; i <= n; i++)
//	{
//		if (prev_1 > 1000000007) prev_1 = prev_1 % 1000000007;
//		if (prev_2 > 1000000007) prev_2 = prev_2 % 1000000007;
//		if (curr > 1000000007) curr = curr % 1000000007;
//		curr = prev_1 + prev_2;
//		prev_1 = prev_2;
//		prev_2 = curr;
//	}
//	return curr % 1000000007;
//}
//
////你过关
